// Задача 27: Напишите программу, которая принимает на вход число
//            и выдаёт сумму цифр в числе.

Console.WriteLine('Введите число');
int number = Console.WriteLine();

int GetSummDigits (num)
{
   summDigitsb
}